//
//  ViewController+SubviewsSizes.h
//  DrawUINewPattern
//
//  Created by Uber on 17/12/2018.
//  Copyright © 2018 uber. All rights reserved.
//

#import "ViewController.h"

@class Model;

/*///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
      _______. __    __  .______   ____    ____  __   ___________    __    ____   _______.        _______. __   ________   _______
     /       ||  |  |  | |   _  \  \   \  /   / |  | |   ____\   \  /  \  /   /  /       |       /       ||  | |       /  |   ____|
    |   (----`|  |  |  | |  |_)  |  \   \/   /  |  | |  |__   \   \/    \/   /  |   (----`      |   (----`|  | `---/  /   |  |__
     \   \    |  |  |  | |   _  <    \      /   |  | |   __|   \            /    \   \           \   \    |  |    /  /    |   __|
 .----)   |   |  `--'  | |  |_)  |    \    /    |  | |  |____   \    /\    / .----)   |      .----)   |   |  |   /  /----.|  |____
 |_______/     \______/  |______/      \__/     |__| |_______|   \__/  \__/  |_______/       |_______/    |__|  /________||_______|
 
 ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////*/


/*
 Introduction:
 Категория (SubviewsSizes) Отвечает расчет размеров и координат Subviews.
 Explanation:
 --------------------------------------------------------------------------------
 1. -cgrectFor_WelcomeLblwithModel:withParentFrame: Расчитывает размер и координаты
    для label, изходя из рамера superView и текущей ориентации.
 --------------------------------------------------------------------------------
 2. -cgrectFor_RectViewWithModel:withParentFrame: Расчитывает размеры и координаты
    для синего вью, изходя из рамера superView и текущей ориентации.
 --------------------------------------------------------------------------------
 */

@interface ViewController (SubviewsSizes)

- (CGRect) cgrectFor_WelcomeLblwithModel:(Model*) model withParentFrame:(CGRect) frame;
- (CGRect) cgrectFor_RectViewWithModel:(Model*)   model withParentFrame:(CGRect) frame;

@end
